// *********************************************************************************************************************
// *                                        Состояние самолета "готов к рулежке"                                       *
// *                                                                                                                   *
// * Eugene G. Sysoletin <e.g.sysoletin@gmail.com>                                        Created 15 may 2020 at 12:29 *
// *********************************************************************************************************************
#include "aircraft_state_ready_for_taxing.h"

using namespace xenon;

// *********************************************************************************************************************
// *                                                                                                                   *
// *                                                    Конструктор.                                                   *
// *                                                                                                                   *
// *********************************************************************************************************************

AircraftStateReadyForTaxing::AircraftStateReadyForTaxing( 
    AbstractAircraft * ptr_acf, const aircraft_state_graph::graph_t::vertex_descriptor & nd 
) : AircraftAbstractState( ptr_acf, nd )
{
}
