// *********************************************************************************************************************
// *                                   Торможение при рулении, вплоть до полной остановки                              *
// *                                                                                                                   *
// * Eugene G. Sysoletin <e.g.sysoletin@gmail.com>                                        Created 08 jul 2020 at 16:44 *
// *********************************************************************************************************************
#include "aircraft_does_taxing_stop.h"

using namespace xenon;

// *********************************************************************************************************************
// *                                                                                                                   *
// *                                                    Конструктор                                                    *
// *                                                                                                                   *
// *********************************************************************************************************************
AircraftDoesTaxingStop::AircraftDoesTaxingStop(
    AbstractAircraft* ptr_acf, const aircraft_state_graph::graph_t::edge_descriptor& edge_d
) : AircraftAbstractAction( ptr_acf, edge_d )
{
}

// *********************************************************************************************************************
// *                                                                                                                   *
// *                                             Внутренний старт действия                                             *
// *                                                                                                                   *
// *********************************************************************************************************************

void AircraftDoesTaxingStop::_internal_start() {
    
    _ptr_acf->vcl_condition.target_speed = 0;
    // Предположим, мы хотим остановиться за 3 секунды.
    if ( _ptr_acf->vcl_condition.speed ) {
        _ptr_acf->vcl_condition.acceleration = - _ptr_acf->vcl_condition.speed / 3.0;
    }
}

// *********************************************************************************************************************
// *                                                                                                                   *
// *                                                Один шаг действия                                                  *
// *                                                                                                                   *
// *********************************************************************************************************************

void AircraftDoesTaxingStop::_internal_step(const float& elapsed_since_last_call) {
    if ( _ptr_acf->vcl_condition.speed <= 0.2 ) _finish();
}



