// *********************************************************************************************************************
// *                                              Состояние "в полете"                                                 *
// *                                                                                                                   *
// * Eugene G. Sysoletin <e.g.sysoletin@gmail.com>                                        Created 11 jul 2020 at 10:52 *
// *********************************************************************************************************************
#include "aircraft_state_on_the_fly.h"
using namespace xenon;

// *********************************************************************************************************************
// *                                                                                                                   *
// *                                                  Конструктор                                                      *
// *                                                                                                                   *
// *********************************************************************************************************************

AircraftStateOnTheFly::AircraftStateOnTheFly(
    AbstractAircraft * ptr_acf, const aircraft_state_graph::graph_t::vertex_descriptor & nd
) : AircraftAbstractState( ptr_acf, nd )
{
}
