// *********************************************************************************************************************
// *                                                    Взлет произведен                                               *
// *                                                                                                                   *
// * Eugene G. Sysoletin <e.g.sysoletin@gmail.com>                                        Created 20 may 2020 at 12:05 *
// *********************************************************************************************************************

#include "aircraft_state_airborned.h"

// *********************************************************************************************************************
// *                                                                                                                   *
// *                                                     Конструктор                                                   *
// *                                                                                                                   *
// *********************************************************************************************************************

AircraftStateAirborned::AircraftStateAirborned(  
    AbstractAircraft * ptr_acf, const aircraft_state_graph::graph_t::vertex_descriptor & nd 
) : AircraftAbstractState( ptr_acf, nd ) 
{
    
}

// *********************************************************************************************************************
// *                                                                                                                   *
// *                                           Активация состояния "взлетел"                                           *
// *                                                                                                                   *
// *********************************************************************************************************************

void AircraftStateAirborned::_internal_activate() {
    // После взлета убираем все точки полетного плана, которые относились к 
    // земле, к фазам руления, выравнивания и собственно взлета.
    auto wp = _ptr_acf->flight_plan.get(0);
    while (
        ( wp.type == WAYPOINT_PARKING )
        || ( wp.type == WAYPOINT_TAXING )
        || ( wp.type == WAYPOINT_RUNWAY )
    ) {
        _ptr_acf->flight_plan.pop_front();
        wp = _ptr_acf->flight_plan.get(0);
    };
        
}
