// *********************************************************************************************************************
// *                                               Самолет вышел на глиссаду                                           *
// *                                                                                                                   *
// * Eugene G. Sysoletin <e.g.sysoletin@gmail.com>                                        Created 21 may 2020 at 14:11 *
// *********************************************************************************************************************

#include "aircraft_state_on_final.h"

using namespace xenon;

// *********************************************************************************************************************
// *                                                                                                                   *
// *                                                      Конструктор                                                  *
// *                                                                                                                   *
// *********************************************************************************************************************

AircraftStateOnFinal::AircraftStateOnFinal( 
    AbstractAircraft * ptr_acf, const aircraft_state_graph::graph_t::vertex_descriptor & nd
) : AircraftAbstractState( ptr_acf, nd )
{
}

// *********************************************************************************************************************
// *                                                                                                                   *
// *                                             Внутренняя активация действия                                         *
// *                                                                                                                   *
// *********************************************************************************************************************

void AircraftStateOnFinal::_internal_activate() {
    
    auto wp0 = _ptr_acf->flight_plan.get(0);
    if ( wp0.type != WAYPOINT_RUNWAY ) 
            _ptr_acf->flight_plan.pop_front();

}
