// *********************************************************************************************************************
// *                               Самолет освободил ВПП и дальше пойдет руление на стоянку                            *
// *                                                                                                                   *
// * Eugene G. Sysoletin <e.g.sysoletin@gmail.com>                                        Created 21 may 2020 at 14:21 *
// *********************************************************************************************************************

#include "aircraft_state_runway_leaved.h"

using namespace xenon;

// *********************************************************************************************************************
// *                                                                                                                   *
// *                                                      Конструктор                                                  *
// *                                                                                                                   *
// *********************************************************************************************************************

AircraftStateRunwayLeaved::AircraftStateRunwayLeaved(
    AbstractAircraft * ptr_acf, const aircraft_state_graph::graph_t::vertex_descriptor & nd
) : AircraftAbstractState( ptr_acf, nd )
{
}

