// *********************************************************************************************************************
// *                  Самолет завершил посадку и освобождает ВПП для дальнейшей рулежки на стоянку                     *
// *                                                                                                                   *
// * Eugene G. Sysoletin <e.g.sysoletin@gmail.com>                                        Created 21 may 2020 at 16:25 *
// *********************************************************************************************************************

#include "aircraft_does_runway_leaving.h"

using namespace xenon;

// *********************************************************************************************************************
// *                                                                                                                   *
// *                                                    Конструктор                                                    *
// *                                                                                                                   *
// *********************************************************************************************************************

AircraftDoesRunwayLeaving::AircraftDoesRunwayLeaving(
    AbstractAircraft * ptr_acf, const aircraft_state_graph::graph_t::edge_descriptor & edge_d
) : AircraftAbstractAction( ptr_acf, edge_d )
{
}

// *********************************************************************************************************************
// *                                                                                                                   *
// *                                             Внутренний старт действия                                             *
// *                                                                                                                   *
// *********************************************************************************************************************

void AircraftDoesRunwayLeaving::_internal_start() {
}

// *********************************************************************************************************************
// *                                                                                                                   *
// *                                              Внутренний шаг действия                                              *
// *                                                                                                                   *
// *********************************************************************************************************************

void AircraftDoesRunwayLeaving::_internal_step( const float & elapsed_since_last_call ) {
}
