// *********************************************************************************************************************
// *                          Интерфейс некоего абстрактного действия (ребро графа состояний самолета).                *
// *                                                                                                                   *
// * Eugene G. Sysoletin <e.g.sysoletin@gmail.com>                                        Created 15 may 2020 at 14:04 *
// *********************************************************************************************************************

#include "aircraft_abstract_action.h"

using namespace xenon;

// *********************************************************************************************************************
// *                                                                                                                   *
// *                                                    Конструктор.                                                   *
// *                                                                                                                   *
// *********************************************************************************************************************

AircraftAbstractAction::AircraftAbstractAction (
    AbstractAircraft * ptr_acf, const aircraft_state_graph::graph_t::edge_descriptor & edge_d 
) {
    _edge_d = edge_d;
    _ptr_acf = ptr_acf;
    
    __total_duration = 0.0;
    __started = false;
    __finished = false;
}

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                              Старт данного действия                                              *
// *                                                                                                                  *
// ********************************************************************************************************************

void AircraftAbstractAction::__start() {
    
    if ( ! __started ) {
        _internal_start();
        __total_duration = 0.0;
        __started = true;
    };
    
}

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                      Один "шаг" выполнения данного действия                                      *
// *                                                                                                                  *
// ********************************************************************************************************************

void AircraftAbstractAction::__step( float elapsed_since_last_time ) {
    
    if (( __started ) && ( ! __finished )) {
        _internal_step( elapsed_since_last_time );
        __total_duration += elapsed_since_last_time;
    }
    
}

// *********************************************************************************************************************
// *                                                                                                                   *
// *                                       Окончание выполнения данного действия                                       *
// *                                                                                                                   *
// *********************************************************************************************************************

void AircraftAbstractAction::_finish() {
    __finished = true;
    if ( _ptr_acf ) _ptr_acf->does_finished( this );
}
