// *********************************************************************************************************************
// *                                            Абстрактное состояние самолета                                         *
// *                                                                                                                   *
// * Eugene G. Sysoletin <e.g.sysoletin@gmail.com>                                        Created 15 may 2020 at 10:54 *
// *********************************************************************************************************************

#include "aircraft_abstract_state.h"
using namespace xenon;

// *********************************************************************************************************************
// *                                                                                                                   *
// *                                                    Конструктор.                                                   *
// *                                                                                                                   *
// *********************************************************************************************************************

AircraftAbstractState::AircraftAbstractState(
    AbstractAircraft * ptr_acf, const aircraft_state_graph::graph_t::vertex_descriptor & nd 
) {
    _node_d = nd;
    _ptr_acf = ptr_acf;
}
