// *********************************************************************************************************************
// *                                                    Взлет произведен                                               *
// *                                                                                                                   *
// * Eugene G. Sysoletin <e.g.sysoletin@gmail.com>                                        Created 20 may 2020 at 12:05 *
// *********************************************************************************************************************

#include "aircraft_state_airborned.h"

// *********************************************************************************************************************
// *                                                                                                                   *
// *                                                     Конструктор                                                   *
// *                                                                                                                   *
// *********************************************************************************************************************

AircraftStateAirborned::AircraftStateAirborned(  
    AbstractAircraft * ptr_acf, const aircraft_state_graph::graph_t::vertex_descriptor & nd 
) : AircraftAbstractState( ptr_acf, nd ) 
{
    
}
