// *********************************************************************************************************************
// *                          Выталкивание самолета (действие, ребро графа состояний самолета)                         *
// *                                                                                                                   *
// * Eugene G. Sysoletin <e.g.sysoletin@gmail.com>                                        Created 15 may 2020 at 14:27 *
// *********************************************************************************************************************

#include "aircraft_does_push_back.h"

using namespace xenon;

// *********************************************************************************************************************
// *                                                                                                                   *
// *                                                     Конструктор                                                   *
// *                                                                                                                   *
// *********************************************************************************************************************

AircraftDoesPushBack::AircraftDoesPushBack(
    AbstractAircraft * ptr_acf, const aircraft_state_graph::graph_t::edge_descriptor & edge_d 
) : AircraftAbstractAction( ptr_acf, edge_d )
{
}

// *********************************************************************************************************************
// *                                                                                                                   *
// *                                          Внутренняя процедура начала действия                                     *
// *                                                                                                                   *
// *********************************************************************************************************************

void AircraftDoesPushBack::_internal_start() {
}

// *********************************************************************************************************************
// *                                                                                                                   *
// *                                         Один шаг в выполнении данного действия                                    *
// *                                                                                                                   *
// *********************************************************************************************************************

void AircraftDoesPushBack::_internal_step ( float elapsed_since_last_time ) {
}



