// *********************************************************************************************************************
// *                                               Самолет вышел на глиссаду                                           *
// *                                                                                                                   *
// * Eugene G. Sysoletin <e.g.sysoletin@gmail.com>                                        Created 21 may 2020 at 14:11 *
// *********************************************************************************************************************

#include "aircraft_state_on_final.h"

using namespace xenon;

// *********************************************************************************************************************
// *                                                                                                                   *
// *                                                      Конструктор                                                  *
// *                                                                                                                   *
// *********************************************************************************************************************

AircraftStateOnFinal::AircraftStateOnFinal( 
    AbstractAircraft * ptr_acf, const aircraft_state_graph::graph_t::vertex_descriptor & nd
) : AircraftAbstractState( ptr_acf, nd )
{
}

