// *********************************************************************************************************************
// *       Если действие было завершено, то надо каким-то образом сообщить об на вышестоящий уровень (в граф).         *
// *                             Описание интерфейса факта завершения текущего действия.                               *
// *                                                                                                                   *
// * Eugene G. Sysoletin <e.g.sysoletin@gmail.com>                                        Created 15 may 2020 at 11:51 *
// *********************************************************************************************************************
#pragma once

namespace xenon {
    
    class DoesFinishedReactor {
        public:
            virtual void does_finished() = 0;
        
    }; // class DoesFinishedReactor
    
}; // namespace xenon
