// *********************************************************************************************************************
// *                                    Внешний (по отношению к X-Plane) самолет.                                      *
// *                                                                                                                   *
// * Eugene G. Sysoletin <e.g.sysoletin@gmail.com>                                        Created 29 may 2020 at 09:44 *
// *********************************************************************************************************************

#include "external_aircraft.h"

using namespace xenon;

// *********************************************************************************************************************
// *                                                                                                                   *
// *                                                   Конструктор                                                     *
// *                                                                                                                   *
// *********************************************************************************************************************

ExternalAircraft::ExternalAircraft(
    const std::string & icao_type, const std::string & icao_airline, const std::string & livery
) {
    acIcaoType = icao_type;
    acIcaoAirline = icao_airline;
    acLivery = livery;
}

// *********************************************************************************************************************
// *                                                                                                                   *
// *                                 Виртуальная функция изменения положения самолета                                  *
// *                                                                                                                   *
// *********************************************************************************************************************
void ExternalAircraft::UpdatePosition(
    [[maybe_unused]] float elapsed_since_last_call,
    [[maybe_unused]] int fl_counter
) {

}
