// *********************************************************************************************************************
// *                                   Файл состояния IVAO (кто где есть и в каком качестве).                          *
// *                                                                                                                   *
// * Eugene G. Sysoletin <e.g.sysoletin@gmail.com>                                        Created 29 mar 2020 at 19:47 *
// *********************************************************************************************************************
#ifdef IVAO

#include "ivao_whazzup_file.h"
#include "ivao_status_file.h"
#include "url.h"

// *********************************************************************************************************************
// *                                                                                                                   *
// *                                                     Конструктор.                                                  *
// *                                                                                                                   *
// *********************************************************************************************************************
xenon::IVAOWhazzupFile::IVAOWhazzupFile() 
    : IVAOPeriodicallyUpdatedFile()
{
    // Интервал перезагрузки в секундах. IVAO рекомендует раз в 5 минут.
    _refreshable_interval_in_seconds = 5*60;
    _file_name = std::string("whazzup.txt");
    
    // Это все на пока, будет перекрыто в процессе получения файла. Потому
    // что реальные host, scheme, url - зависят от файла статуса IVAO.
    
    _host = std::string("localhost");
    _scheme = std::string("http");
    _url = std::string("/");
}

// *********************************************************************************************************************
// *                                                                                                                   *
// *                                             Перекрытый метод чтения файла                                         *
// *                                                                                                                   *
// *********************************************************************************************************************

void xenon::IVAOWhazzupFile::read() {
    IVAOPeriodicallyUpdatedFile::read();
    // Парзинг прочитанного содержимого файла.
}

// *********************************************************************************************************************
// *                                                                                                                   *
// *                                        Перекрытый метод получения файла с вэба                                    *
// *                                                                                                                   *
// *********************************************************************************************************************

std::string xenon::IVAOWhazzupFile::request_from_web() {
    
    // Сначала нужно перечитать файл статуса. Потому что реальный
    // адрес хоста, сервис (схема или служба) и URL определяются - им.
    IVAOStatusFile status_file;
    status_file.read();
    
    // Теперь формируем собственные host, scheme, url
    URL whazzup_url(status_file.whazzup_url());
    _host = whazzup_url.host();
    _scheme = whazzup_url.protocol();
    _url = whazzup_url.path();
    
    // Запрашиваем файл.
    std::string whazzup = IVAOPeriodicallyUpdatedFile::request_from_web();
    return whazzup;
}

#endif // IVAO
