// *********************************************************************************************************************
// *              Поток периодического чтения текущего состояния IVAO с использованием IVAO API whazzup                *
// *                                                                                                                   *
// * Eugene G. Sysoletin <e.g.sysoletin@gmail.com>                                        Created 27 mar 2020 at 13:32 *
// *********************************************************************************************************************

#ifdef IVAO

#include "whazzup_reader_thread.h"

#include <unistd.h>

#include "settings.h"
#include "xplane_utilities.h"
#include "ivao_status_file.h"
#include "ivao_whazzup_file.h"

using namespace std;
using namespace xenon;

#ifdef INTERNAL_XPLANE
extern void whazzup_reloaded(void);
#endif

// *********************************************************************************************************************
// *                                                                                                                   *
// *                                             Внутренние данные модуля.                                             *
// *                                                                                                                   *
// *********************************************************************************************************************

// *********************************************************************************************************************
// *                                                                                                                   *
// *                                Внутренние (не экспортируемые) определения функций.                                *
// *                                                                                                                   *
// *********************************************************************************************************************

// *********************************************************************************************************************
// *                                                                                                                   *
// *                                             Получение статус-файла IVAO                                           *
// *                                                                                                                   *
// *********************************************************************************************************************

void fetch_ivao_status() {
    
    IVAOStatusFile status_file;
    if (status_file.can_be_updated()) {
        // Файла статуса - либо нет, либо его можно перезагрузить.
        // В случае с файлом статуса результат операции нам не
        // интересен. Перезагрузили - и хорошо.
        status_file.reload();
    }    
}

// *********************************************************************************************************************
// *                                                                                                                   *
// *                                Получение файла whazzup, кто где есть в IVAO прямо сейчас.                         *
// *                                                                                                                   *
// *********************************************************************************************************************

void fetch_whazzup() {
    IVAOWhazzupFile whazzup_file;
    if ( whazzup_file.can_be_updated() ) {
        if (whazzup_file.reload()) {
            // Файл был пере-получен с интернета.
            // Нужно об этом сообщить вышележащим уровням.
#ifdef INTERNAL_XPLANE
            whazzup_reloaded();
#else
            cout << "whazzup file reloaded.";
#endif
        };
    }
}

// *********************************************************************************************************************
// *                                                                                                                   *
// *                                               Метод выполнения потока                                             *
// *                                                                                                                   *
// *********************************************************************************************************************

void * xenon::whazzup_reader_thread(void * args) {

    // Ушли в бесконечный цикл выполнения потока.

    for (;;) {
        try {
            fetch_ivao_status();
            fetch_whazzup();
            // Впадаем в сон. Таким образом поток, вообще-то никому не мешается.
            sleep(WHAZZUP_SLEEP_SECONDS);
        } catch (std::exception const & e ) {
            XPlaneUtilities::log(string("ERROR: whazzup thread: ") + e.what());
        }
    }
}

#endif // IVAO
