// *********************************************************************************************************************
// *                       Фрейм, имеющий отношение к определенному состоянию (узел графа) самолета                    *
// *                                                                                                                   *
// * Eugene G. Sysoletin <e.g.sysoletin@gmail.com>                                        Created 07 jul 2020 at 11:53 *
// *********************************************************************************************************************

#include "state_frame.h"
using namespace xenon;

// *********************************************************************************************************************
// *                                                                                                                   *
// *                                                    Конструктор                                                    *
// *                                                                                                                   *
// *********************************************************************************************************************

StateFrame::StateFrame(BimboAircraft * bimbo, ConnectedCommunicatorReactor * environment ) 
    : AbstractFrame()
{
    _environment = environment;
    _ptr_acf = bimbo;
        
    _next_action.action = ACF_DOES_NOTHING;
    _next_action.priority = 1;
    _activated = false;
    
    _our_location = _ptr_acf->get_location();
    _our_rotation = _ptr_acf->get_rotation();
};

// *********************************************************************************************************************
// *                                                                                                                   *
// *                               До начала обновления - установка переменных по умолчанию                            *
// *                                                                                                                   *
// *********************************************************************************************************************

void StateFrame::_before_update() {
    
    _next_action.action = ACF_DOES_NOTHING;
    _activated = false;
    
    _our_location = _ptr_acf->get_location();
    _our_rotation = _ptr_acf->get_rotation();
    
}


// *********************************************************************************************************************
// *                                                                                                                   *
// *                                                Результат фрейма                                                   *
// *                                                                                                                   *
// *********************************************************************************************************************

void StateFrame::result( next_action_t & next_action ) {
    next_action = _next_action;
}
