// *********************************************************************************************************************
// *                     Запросить у сервера всех агентов, которые может "слышать" данный агент.                       *
// *                                                                                                                   *
// * Eugene G. Sysoletin <e.g.sysoletin@gmail.com>                                        Created 31 may 2020 at 14:48 *
// *********************************************************************************************************************

#include "cmd_query_around.h"

using namespace xenon;

// *********************************************************************************************************************
// *                                                                                                                   *
// *                                                Пустой конструктор                                                 *
// *                                                                                                                   *
// *********************************************************************************************************************

CmdQueryAround::CmdQueryAround() : AbstractCommand() {
    _command_name = "CmdQueryAround";
}

// *********************************************************************************************************************
// *                                                                                                                   *
// *                                             Конструктор от параметров                                             *
// *                                                                                                                   *
// *********************************************************************************************************************

CmdQueryAround::CmdQueryAround(const vehicle_condition_t & vcl_condition)
    : AbstractCommand( SAY_TO_NOBODY, vcl_condition )
{
    _command_name = "CmdQueryAround";
}

