// *********************************************************************************************************************
// *                     Запросить у сервера всех агентов, которые может "слышать" данный агент.                       *
// *                                                                                                                   *
// * Eugene G. Sysoletin <e.g.sysoletin@gmail.com>                                        Created 31 may 2020 at 14:48 *
// *********************************************************************************************************************

#include "cmd_query_around.h"

using namespace xenon;

// *********************************************************************************************************************
// *                                                                                                                   *
// *                                                Пустой конструктор                                                 *
// *                                                                                                                   *
// *********************************************************************************************************************

CmdQueryAround::CmdQueryAround() : AbstractCommand() {
    _command_name = "CmdQueryAround";
}

// *********************************************************************************************************************
// *                                                                                                                   *
// *                                             Конструктор от параметров                                             *
// *                                                                                                                   *
// *********************************************************************************************************************

CmdQueryAround::CmdQueryAround(const vehicle_condition_t & vcl_condition)
    : AbstractCommand( SAY_TO_NOBODY, vcl_condition )
{
    _command_name = "CmdQueryAround";
}

// *********************************************************************************************************************
// *                                                                                                                   *
// *                                        Преобразование из объекта в JSON                                           *
// *                                                                                                                   *
// *********************************************************************************************************************

void CmdQueryAround::to_json( JSON & json ) {
    AbstractCommand::to_json( json );
}

// *********************************************************************************************************************
// *                                                                                                                   *
// *                                         Преобразование из JSONа в объект                                          *
// *                                                                                                                   *
// *********************************************************************************************************************

void CmdQueryAround::from_json( JSON & json ) {
    AbstractCommand::from_json( json );
}

// *********************************************************************************************************************
// *                                                                                                                   *
// *                                          Выполнение команды на сервере                                            *
// *                                                                                                                   *
// *********************************************************************************************************************
#ifdef SERVER_SIDE
void CmdQueryAround::execute_on_server( ConnectedClientCore * client, ClientsListener * server ) {

    // Здесь вызова нижележащего уровня - вообще не происходит, 
    // т.к. данную команду никому пересылать не надо. Сразу же
    // вызывается у "сервера" запрос об окружающих агентах.
    server->send_around( agent_uuid() );

}
#endif
