// *********************************************************************************************************************
// *                                            Class which can be present in JSON form.                               *
// *                                                                                                                   *
// * Eugene G. Sysoletin <e.g.sysoletin@gmail.com>                                        Created 15 mar 2019 at 20:20 *
// *********************************************************************************************************************

#include "jsonable.h"

using namespace xenon;

string xenon::JSONAble::COMMAND_NAME="JSONAble";

// *********************************************************************************************************************
// *                                                                                                                   *
// *                                             The constructor of JSONAble object                                    *
// *                                                                                                                   *
// *********************************************************************************************************************

JSONAble::JSONAble() {
    _command_name = JSONAble::COMMAND_NAME;
}

// *********************************************************************************************************************
// *                                                                                                                   *
// *                                                Present object in JSON form                                        *
// *                                                                                                                   *
// *********************************************************************************************************************

void JSONAble::to_json( JSON & json ) {

    json["command_name"] = this->_command_name;

}

// ********************************************************************************************************************
// *                                                                                                                  *
// *                               "Соединить" произвольный JSON объект с его базовой частью.                         *
// *                                                                                                                  *
// ********************************************************************************************************************
/*
JSON xenon::JSONAble::concat(JSON & one, JSON & two) {

    // "Базовое" представление JSON-объекта.
    // Смысл - достать оттуда имя команды.


    // Concatenation of both JSONs

    for (JSON::iterator it = json.begin(); it != json.end(); ++it) {
        basic[it.key()] = it.value();
    }

    return basic;

}
*/

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                            Assemble object from JSON form                                        *
// *                                                                                                                  *
// ********************************************************************************************************************

void JSONAble::from_json( JSON & json ) {

    _command_name = json.value( "command_name", UNKNOWN_COMMAND_NAME);

};
