// *********************************************************************************************************************
// *                      Любой объект, который существует внутри X-Plane и может перемещаться                         *
// *                                                                                                                   *
// * Eugene G. Sysoletin <e.g.sysoletin@gmail.com>                                        Created 02 may 2020 at 11:05 *
// *********************************************************************************************************************

#include "abstract_vehicle.h"
#include "xplane.hpp"

using namespace xenon;

// *********************************************************************************************************************
// *                                                                                                                   *
// *                                                  Конструктор.                                                     *
// *                                                                                                                   *
// *********************************************************************************************************************
AbstractVehicle::AbstractVehicle() {

}

// *********************************************************************************************************************
// *                                                                                                                   *
// *                                               Локация самоходки                                                   *
// *                                                                                                                   *
// *********************************************************************************************************************

location_t AbstractVehicle::get_location() {
    position_t position = get_position();
    return XPlane::position_to_location(position);
}

// *********************************************************************************************************************
// *                                                                                                                   *
// *                                         Установка гео-позиции инстанции                                           *
// *                                                                                                                   *
// *********************************************************************************************************************

void AbstractVehicle::set_location( const location_t & location ) {
    position_t position = XPlane::location_to_position( location );
    set_position( position );
}
