// *********************************************************************************************************************
// *                                             Граф путей аэропорта.                                                 *
// *                                                                                                                   *
// * Eugene G. Sysoletin <e.g.sysoletin@gmail.com>                                        Created 10 may 2020 at 15:34 *
// *********************************************************************************************************************

#include <string>

#include "airport_network.h"

using namespace xenon;
using namespace std;
using namespace lemon;

// *********************************************************************************************************************
// *                                                                                                                   *
// *                                                Конструктор                                                        *
// *                                                                                                                   *
// *********************************************************************************************************************

AirportNetwork::AirportNetwork()
    : node_latitude( * this, 0.0 )
    , node_longitude( * this, 0.0 )
    , node_xp_id( * this, -1 )
    , node_usage( * this )
    , node_name( * this )
    , arc_vehicle_type( * this, VT_UNKNOWN )
    , arc_way_type( * this, WAY_NONE )
    , arc_name( * this )
    , arc_active_zones( * this )
{
};

// *********************************************************************************************************************
// *                                                                                                                   *
// *                                             Оператор присвоения                                                   *
// *                                                                                                                   *
// *********************************************************************************************************************

AirportNetwork & AirportNetwork::operator = ( const AirportNetwork & anet ) {
    digraphCopy( anet, * this );
    return * this;
}

// *********************************************************************************************************************
// *                                                                                                                   *
// *                                Получить узел по его идентификатору из X-Plane                                     *
// *                                                                                                                   *
// *********************************************************************************************************************

ListDigraph::NodeIt AirportNetwork::get_node_by_xp_id(const int &xp_id) {

    for (ListDigraph::NodeIt n( * this ); n != INVALID; ++n) {
        if (node_xp_id[n] == xp_id ) return n;
    }
    return INVALID;

}