// *********************************************************************************************************************
// *         Любой внешний агент, который может общаться с коммуникатором и через него - с другими агентами            *
// *                                                                                                                   *
// * Eugene G. Sysoletin <e.g.sysoletin@gmail.com>                                        Created 27 may 2020 at 08:13 *
// *********************************************************************************************************************

#include "abstract_agent.h"

using namespace xenon;
using namespace std;

// *********************************************************************************************************************
// *                                                                                                                   *
// *                                                   Конструктор                                                     *
// *                                                                                                                   *
// *********************************************************************************************************************

AbstractAgent::AbstractAgent( const std::string & uuid ) {

    _communicator = new ConnectedCommunicator( this );

    if ( ! Airport::airports_was_readed() ) {        
        Airport::read_all();
    }

    // Ждем, пока аэропорт не вычитает свои данные.
    Logger::log("Waiting airports readed...");
    while ( ! Airport::airports_was_readed() ) {
        usleep(50);
    }
    Logger::log("apts readed, ok.");
}

// *********************************************************************************************************************
// *                                                                                                                   *
// *                                                   Деструктор                                                      *
// *                                                                                                                   *
// *********************************************************************************************************************

AbstractAgent::~AbstractAgent() {
    if ( _communicator ) {
        delete( _communicator );
        _communicator = nullptr;
    }
}

