// *********************************************************************************************************************
// *         Любой внешний агент, который может общаться с коммуникатором и через него - с другими агентами            *
// *                                                                                                                   *
// * Eugene G. Sysoletin <e.g.sysoletin@gmail.com>                                        Created 27 may 2020 at 08:13 *
// *********************************************************************************************************************

#include "abstract_agent.h"

using namespace xenon;

// *********************************************************************************************************************
// *                                                                                                                   *
// *                                                   Конструктор                                                     *
// *                                                                                                                   *
// *********************************************************************************************************************

AbstractAgent::AbstractAgent( const std::string & uuid, const agent_t & agent_type ) {
    _communicator = new ConnectedCommunicator( this, agent_type, uuid );
}

// *********************************************************************************************************************
// *                                                                                                                   *
// *                                                   Деструктор                                                      *
// *                                                                                                                   *
// *********************************************************************************************************************

AbstractAgent::~AbstractAgent() {
    if ( _communicator ) {
        delete( _communicator );
        _communicator = nullptr;
    }
}

