// *********************************************************************************************************************
// *                                Несколько агентов для тестирования, потом уйдет в базу данных                      *
// *                                                                                                                   *
// * Eugene G. Sysoletin <e.g.sysoletin@gmail.com>                                        Created 30 may 2020 at 12:59 *
// *********************************************************************************************************************

#pragma once


#define BOEING_1    "4204f982a17811eaaf3794de807942f4"
#define BE58_1      "9c72a710a24b11ea89d394de807942f4"
