// *********************************************************************************************************************
// *                                    Общий предок всех передаваемых по сети команд (v2.0)                           *
// *                                                                                                                   *
// * Eugene G. Sysoletin <e.g.sysoletin@gmail.com>                                        Created 27 may 2020 at 10:10 *
// *********************************************************************************************************************

#include "abstract_command.h"

using namespace xenon;

// *********************************************************************************************************************
// *                                                                                                                   *
// *                                                    Конструктор                                                    *
// *                                                                                                                   *
// *********************************************************************************************************************

AbstractCommand::AbstractCommand() : JSONAble() {
    __packet_number = 0;
}

// *********************************************************************************************************************
// *                                                                                                                   *
// *                                         Преобразование из объекта в JSON                                          *
// *                                                                                                                   *
// *********************************************************************************************************************

void AbstractCommand::to_json ( JSON & json ) {
    JSONAble::to_json( json );
    json["packet_number"] = __packet_number;
    json["agent_uuid"] = __agent_uuid;
    json["agent_type"] = ( int ) __agent_type;
}

// *********************************************************************************************************************
// *                                                                                                                   *
// *                                        Преобразование из JSONа в объект                                           *
// *                                                                                                                   *
// *********************************************************************************************************************

void AbstractCommand::from_json ( JSON & json ) {
    JSONAble::from_json( json );
    __packet_number = json.value( "packet_number", 0 );
    __agent_uuid = json.value("agent_uuid", "");
    __agent_type = ( agent_t ) json.value("agent_type", (int)AGENT_UNKNOWN );
}

